; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=189, out_folder=htg/blocksworld/training, instance_id=23, seed=2047, goal_proportion=0.03

(define (problem blocksworld-23)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on-table b1)
    (clear b22)
    (on b22 b148)
    (on b148 b86)
    (on-table b86)
    (clear b89)
    (on-table b89)
    (clear b127)
    (on-table b127)
    (clear b65)
    (on-table b65)
    (clear b16)
    (on b16 b56)
    (on b56 b184)
    (on b184 b142)
    (on b142 b58)
    (on b58 b25)
    (on b25 b94)
    (on-table b94)
    (clear b77)
    (on b77 b55)
    (on b55 b175)
    (on-table b175)
    (clear b36)
    (on-table b36)
    (clear b172)
    (on b172 b33)
    (on b33 b76)
    (on b76 b67)
    (on b67 b82)
    (on-table b82)
    (clear b128)
    (on-table b128)
    (clear b39)
    (on b39 b102)
    (on-table b102)
    (clear b161)
    (on-table b161)
    (clear b164)
    (on b164 b170)
    (on b170 b168)
    (on b168 b186)
    (on b186 b145)
    (on b145 b152)
    (on-table b152)
    (clear b20)
    (on b20 b130)
    (on-table b130)
    (clear b51)
    (on b51 b110)
    (on b110 b61)
    (on-table b61)
    (clear b176)
    (on-table b176)
    (clear b50)
    (on b50 b83)
    (on-table b83)
    (clear b7)
    (on b7 b178)
    (on-table b178)
    (clear b112)
    (on-table b112)
    (clear b166)
    (on b166 b69)
    (on b69 b180)
    (on-table b180)
    (clear b167)
    (on b167 b106)
    (on b106 b84)
    (on-table b84)
    (clear b48)
    (on b48 b88)
    (on b88 b182)
    (on b182 b21)
    (on b21 b137)
    (on-table b137)
    (clear b159)
    (on b159 b146)
    (on-table b146)
    (clear b91)
    (on b91 b155)
    (on b155 b31)
    (on b31 b54)
    (on b54 b59)
    (on b59 b98)
    (on b98 b73)
    (on-table b73)
    (clear b78)
    (on b78 b24)
    (on b24 b43)
    (on b43 b79)
    (on b79 b105)
    (on b105 b71)
    (on b71 b101)
    (on-table b101)
    (clear b185)
    (on-table b185)
    (clear b80)
    (on b80 b68)
    (on b68 b60)
    (on b60 b53)
    (on b53 b6)
    (on b6 b30)
    (on b30 b37)
    (on b37 b12)
    (on b12 b11)
    (on b11 b97)
    (on b97 b143)
    (on b143 b125)
    (on b125 b141)
    (on b141 b187)
    (on b187 b140)
    (on-table b140)
    (clear b169)
    (on-table b169)
    (clear b81)
    (on b81 b3)
    (on b3 b47)
    (on b47 b70)
    (on b70 b116)
    (on b116 b147)
    (on-table b147)
    (clear b2)
    (on b2 b123)
    (on b123 b63)
    (on b63 b162)
    (on b162 b156)
    (on b156 b160)
    (on b160 b118)
    (on b118 b129)
    (on-table b129)
    (clear b4)
    (on b4 b40)
    (on b40 b27)
    (on b27 b96)
    (on b96 b92)
    (on b92 b32)
    (on b32 b124)
    (on b124 b93)
    (on b93 b17)
    (on b17 b109)
    (on-table b109)
    (clear b42)
    (on b42 b126)
    (on b126 b151)
    (on b151 b177)
    (on b177 b52)
    (on b52 b114)
    (on-table b114)
    (clear b44)
    (on b44 b13)
    (on b13 b189)
    (on b189 b9)
    (on b9 b139)
    (on-table b139)
    (clear b64)
    (on b64 b90)
    (on-table b90)
    (clear b150)
    (on-table b150)
    (clear b181)
    (on b181 b113)
    (on b113 b66)
    (on b66 b134)
    (on-table b134)
    (clear b19)
    (on b19 b49)
    (on b49 b149)
    (on b149 b72)
    (on b72 b131)
    (on b131 b173)
    (on b173 b45)
    (on-table b45)
    (clear b74)
    (on-table b74)
    (clear b85)
    (on b85 b5)
    (on b5 b154)
    (on-table b154)
    (clear b111)
    (on b111 b99)
    (on b99 b174)
    (on b174 b26)
    (on b26 b38)
    (on-table b38)
    (clear b153)
    (on-table b153)
    (clear b8)
    (on-table b8)
    (clear b87)
    (on b87 b132)
    (on b132 b122)
    (on b122 b135)
    (on b135 b158)
    (on b158 b165)
    (on b165 b133)
    (on b133 b62)
    (on b62 b179)
    (on b179 b100)
    (on-table b100)
    (clear b28)
    (on b28 b46)
    (on b46 b171)
    (on b171 b103)
    (on b103 b136)
    (on b136 b117)
    (on b117 b34)
    (on-table b34)
    (clear b183)
    (on b183 b157)
    (on b157 b119)
    (on b119 b95)
    (on-table b95)
    (clear b18)
    (on b18 b120)
    (on b120 b15)
    (on-table b15)
    (clear b138)
    (on-table b138)
    (clear b144)
    (on b144 b23)
    (on b23 b108)
    (on b108 b188)
    (on-table b188)
    (clear b41)
    (on b41 b75)
    (on b75 b29)
    (on b29 b10)
    (on b10 b115)
    (on-table b115)
    (clear b104)
    (on b104 b14)
    (on b14 b107)
    (on-table b107)
    (clear b35)
    (on b35 b121)
    (on-table b121)
    (clear b57)
    (on b57 b163)
    (on-table b163))
 (:goal  (and 
    (clear b4)
    (on-table b4)
    (clear b3)
    (on b3 b2)
    (on-table b2)
    (clear b5)
    (on b5 b1)
    (on-table b1))))

; plan
1. (unstack b2 b123)
   deleted: (on b2 b123) (clear b2) (arm-empty)
   added: (holding b2) (clear b123)
   goals met: 2 of 8
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 3 of 8
3. (unstack b4 b40)
   deleted: (on b4 b40) (clear b4) (arm-empty)
   added: (holding b4) (clear b40)
   goals met: 2 of 8
4. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 8
5. (unstack b81 b3)
   deleted: (on b81 b3) (clear b81) (arm-empty)
   added: (holding b81) (clear b3)
   goals met: 5 of 8
6. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 5 of 8
7. (unstack b85 b5)
   deleted: (on b85 b5) (clear b85) (arm-empty)
   added: (holding b85) (clear b5)
   goals met: 6 of 8
8. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 6 of 8
9. (unstack b3 b47)
   deleted: (on b3 b47) (clear b3) (arm-empty)
   added: (holding b3) (clear b47)
   goals met: 5 of 8
10. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 7 of 8
11. (unstack b5 b154)
   deleted: (on b5 b154) (clear b5) (arm-empty)
   added: (holding b5) (clear b154)
   goals met: 6 of 8
12. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 8 of 8
